## 硅谷live以太坊智能合约频道官方地址

### 第一课《智能合约设计初阶-单员工薪酬系统》

目录结构
  <br/>|
  <br/>|--orgin 课程初始代码
  <br/>|
  <br/>|--assignment 课程作业提交代码
<br/> 
### 本节知识点
第1课：智能合约设计初阶-单员工薪酬系统
- 合约的基本概念和定义
- Solidity类型系统与传统语言的异同
- Solidity独特的单位系统
- 区块链系统全局变量：区块信息，消息


# 环节一：开场
今天的开营仪式分为7个环节，分别是

一个月的时间
* 班长 Nicole
* 班长 Nicole
* 班长 Nicole

LA南加州大学
- Tiantian
- 会堂班长
北京 负责9点的打卡，作业提交，催交作业，学习和写作业都不轻松，但越能锻炼更加强大的自己
- Sean
班长，和王新文解决github的问题，有问题可以问


## 环节二：校规
希望在群里更改备注，姓名 城市 职业
## 环节三：导师团队介绍
老董，frank
11位是来自于二期助教，分别是：
1、密歇根大学博士Steven
2、威斯康星大学麦迪逊分校在读研究生蔡至诚
3、毕业于康奈尔大学现就职于Oracle的美女工程师唐涵
4、毕业于北大、普林斯顿大学硕士，现就职于Google的美女工程师刘芳璐
5、上海交大的顺达
6、浙江大学硕士，微软亚研软件工程师李明李老师
7、同济大学硕士，拥有十多年项目管理和系统架构经验的何智华助教
8、不冥想就出局联合创始人，福建 8MIN区块链CEO高冰
9、就职于澳大利亚Hexagon PPM的高级咨询顾问王鲁明
10、毕业于北科，JHU的，现任职Google的Ellie助教
11、北京邮电大学在读研究生刘虹男
申龙斌：
分享学习心得：
做好心理准备，如果本职工作忙，那么要花很多时间，尤其是第五第六课，java script，差点儿放弃
最后在小组成员的帮助下，挺了过来，细节问题找小组助教和组员。
前面的作业一定要积极对待
我是如何当上助教？
具体内容请点击：
《29天编程挑战，收获知识和友谊》
http://mp.weixin.qq.com/s/FhT1gjM4bREEdaSHSj11yg
实际上二期还是有很多问题不懂，但是希望在三期的助教过程中学到更多。


## 环节四：课程大纲介绍
第一节课老董将带大家学习智能合约设计初阶，单员工薪酬系统。
第二节课，我们将基于第一节课，进阶学习多员工薪酬系统。
第三课，老董给大家精心准备了智能合约后端优化和产品化的内容。
第四课，大家将见识到如何使用Truffle架构来进行前后端交互，测试和部署。
第五节课，将会学习到分布式应用前段产品化。
第六节课，将学习到分布式应用前端产品化-进阶
第七节课，也是最后一节更新内容的课程，我们将学习智能合约的主网部署，同时老师会介绍白帽黑客竞赛，利用学到的知识在竞赛里大家用小组团队协作方式破解合约地址，最快破解了合约的那组就可以获得合约里的奖金！很好地诠释了“学习致富”这句话哈哈，所以大家要好好学习啦！
第八节课就是激动人心的时刻！董老师会公布获奖名单，并且做最后的课程答疑。
详细的课程大纲请看下图！

北京时间每周三、日会更新课程，周三晚上10点和周六晚上10点是截至交作业的时间。
不交作业班长和小组长会花式督促你哦~按时完成所有作业将会返还一半的学费！

同时，北京时间周日早上10点在直播间将会有董老师直播解答大家在课程上的疑问！
千万不要错过啦~~

下方是参与直播答疑的方式：

参与周日直播答疑
第一步：关注硅谷live服务号
第二步：答疑开始前点击服务号给你发送的直播提醒~

第一节课将在开营仪式结束后 11点正式更新~！！！请大家关注！


上课时间、地址、交作业流程就不在这里重复了，请查看“入学指南”，如果还有任何疑问请及时提问，我们会以最快的速度帮助你入学指南
https://shimo.im/docs/PW3YHb7LOhg5cCtJ



## 环节五：小组分组介绍

“开拓者A战队”：唐涵助教 、刘彭组长
刘京、崔迪、余轩、执否、黎客来、曹轶辰、吴惟心、田君、姚子豪

“开拓者B战队”：Steven助教、Ray组长
杨春茂、张晓、Haihua Zhu、张继超、王志华、何生亮、李腾、蒋宏伟、李刚

“开拓者C战队”：李明助教、吴逸飞组长
白君、王恩临、秦翀、廖祜秋、李轶男、李丰翔、夏车韵、刘金伟、电书

“开拓者D战队”：高冰助教、陶维英组长
曾美云、林星、陈世强、潘明坚、黄斌、余琛、李伟、陈建清、刘静云

“开拓者E战队”：何智华助教、梁鋆烨组长
王硕、吴冠禧、小拿、杨信、彭康政、李泽、王秀泽、刘毅、王振华

“开拓者F战队”：蔡至诚助教、怀达组长
尹礼春、杨楫、于宏学、史红波、胡闰祺、范燕军、苏攀、曾健生、张谷丰

“开拓者G战队”：梁卫亮助教、廖一鸣组长
宋兴超、朱伟杰、王昕屹、郑广军、宁达非、李子奇、李君镶、刘彪、王瑞栋

“开拓者H战队”：Caitlin助教、陈昶安组长
闫孩/时到花自开、Jeffery、魏梦、熊伟、蔡鑫宁、张庆杰、金诗雨、刘向利、何宇兵

“开拓者 I 战队”：张岩助教、徐蕴博组长
ken、黄鑫实、莫昌星、Wei Li、王颖天、乔勇、李奇楠、蒋雨辰、Tracy Salander、田浩沛

“开拓者J战队”：陈垚文助教、卢嘉赋组长
黄卫勇、姜天宠、孙建刚、陈伟列、徐臻、邬文凯、zhimin he、唐华、晓燕

“开拓者K战队”：黄敏之助教、陈益振组长
刘宗源、丰寅峰、李金马、陈伟、黎倚杭、郝治鑫、杨晨朝、孔扬鑫、金煜

“开拓者L战队”：张子栋助教、陈玲敏组长
Nathan、李一杰、阮月婷、何岩、Benjamin Chen、牛亚萌、荀辰龙、Frank Xia、牛堃

“开拓者M战队”：陈格雷助教、翁启组长
欧翔、Sam Xiang、鑫伟、吴昊睿、沈煜成、黄灿、王凯（微信号：hqmank）、陆涛、王鹏雨

“开拓者N战队”：王鲁明助教、周瑶组长
邓高峰、许鑫鑫、赵燕新、庄承荣、曾建平、陈威、卜祥记、王浩、江源

“开拓者O战队”：齐明助教、张一豪组长
毛崇兆、印添添、王凯2（微信号：xiaopangzi_9）、洪伟、盛峰、潘成鼎、陈文经、郭乔、廖雷

陶维英：
D组组长，10年C++，负责班里区块链项目的研发
8min社区的CEO

## 环节六：课程福利
为了大家更积极的学习、思考与协作，我们采用了积分制来激励大家学习

小组团体奖：设置一个，奖金：价值4000元的eth，采取积分制（小组成员积分之和）
个人学霸奖：设置2位，全额免除学费，采取积分制（个人积分之和）

必修部分 补交 0分，绝交 -2 分，
白猫黑客
选修部分：


积分模式：必修+选修
【积分明细·必修】
1、作业：优秀作业+3分，上交作业+2分，补交 0分，缺交-2分
2、打卡：针对打卡话题的有效评论+1分，每日优质打卡内容前三+2分，每周前三再+1分3、白帽黑客MVP：+5分
4、白帽黑客团体第一：+10分

【积分明细·选修】
1、主动帮助同学解答疑惑+1分
2、主动干货分享+1分（每人限3次加分）
3、每周日的打卡内容为：征集打卡话题，被选上的话题+2分
4、主动分享学习笔记+2分
       5、主动申请在社群直播分享+3分（三期、二期、一期、发烧友、直播群）
      分享形式：类似周六的助教分享会，语音+图文
6、主动协助班长助教的工作+3分，例如：每日复盘整理、活动策划等
7、自行脑洞：一切对课程对同学有价值的事情都可以申请加分

【积分统计规则】
1、必修积分的打卡由各小组组长统计，作业情况由助教统计
      2、选修积分由学员自己自动向@班长天天申请
      3、积分表格：https://docs.google.com/spreadsheets/d/1wFIaFeGkuZ5FF4qDSQX2eSNcmvnfPR7bosbu2x7ySYE/edit?ts=5aa0e091#gid=105166377

班长 tiantian 负责统计的积分，有问题找她。积分表格是可以实时看到每个人的积分情况。

鲸打卡
1、简介：
你以为入群就只是和其它同学交流作业吗？不不不，北京时间每天早上9点，我们会在群内发”鲸达卡“讨论，每天一个区块链、智能合约、数字货币方面的话题，例如：在去中心化的浪潮下，Facebook、Uber、滴滴等传统中心化巨头将何去何从，你觉得他们有何应对策略？ 像是这样的话题。除了回答问题，你也可以为其他同学的优质回答点赞和评论哦~

2、参与方式具体如下
班长会堂在北京时间每天早上9:00发放打卡小程序
班长nicole在美国时间每天早上9:00发放打卡小程序

3、如何获得积分：
1）北京时间24:00之前，学员打卡完成并参与话题思考输出50字以上的内容，获得【+1】积分
2）刘芳璐助教在第二天中午筛选出前一天的优质内容三篇，获得【+2】积分
3）每周的优质评论中积分最高的前三名，额外获得【+1】积分

敬请留意！班班期待大家的优质回答！下图为参加打卡擂台赛的步骤

内容知识拓展：
1）课程疑难知识点解析
每更新完一节课，助教Eille-会对课程中疑难知识点进行汇总和解析，并分别在周三中午12点、周六中午12点于微信群与GitHub·wiki发布 ；
                                               
2）课外知识点拓展
助教刘虹男负责收集课程知识难点相关的阅读资料，甄选与课程相关的优质知识以及阅读清单，在课程页面加一课“干货集锦”分别发布在课程和社群里，例如：智能合约底层基础知识等，每周五晚上10点在微信群于GitHub·wiki发布
 
3）社群/打卡/答疑优质内容沉淀
助教顺达负责每天汇总答疑、打卡、社群分享优质内容数据的导出和收集，每晚优质内容复盘，晚9点发布；同时有兴趣协助顺达助教复盘的同学可以找Nicole班长报名，并且可获得积分喔～


4 live分享会
每周六早上10点，助教会轮流在群里开“live分享会”，详细解读一个区块链或者智能合约相关的项目。你可以参与讨论答疑的环节向ta提问哦~

另外，每周日胡圣托助教会将live分享会内容整理一份复盘文档，并在微信群于GitHub·wiki发布，大家记得观看喔，干货满满

5 常见问题FAQ
在每一课课程更新前，助教夏玮欹、申龙斌会收集课程中遇到的常见问题，并实时汇总更新在 GitHub上，供大家参考。
 
还有更多的福利等着大家！敬请期待啦~

## 环节七：认识新朋友
